# Тестовое задание для middle frontend-разработчика

![Дизайн Компонента Password](https://yadi.sk/i/vAyZkJbHdzuMzQ)

Что нужно сделать по каждому тестовому заданию: 
1. Прочитать и понять, задать вопросы;
2. Оценить;
3. Далее согласуем оценку и начнем;
4. В процессе можно задавать вопросы, писать размышления, дополнения и прочее.

По итогу реализовывать в lskjs-ux, pull request'ом, созваниваемся, обсуждаем решение.

## 1. Компонент Password

Есть Компонент Input, на его основе нужно сделать Компонент Password

Требования к компоненту:
- Добавить кнопку с иконкой глаза, при единичном нажатии на которую будет показываться/скрываться текст, курсор при этом можно уводить в сторону, статус (показано/скрыто) должен сохряняться;
- Привести к дизайну (скриншот прикреплен выше; не обращаем внимание на слабый/надежный);
- Должна быть возможность заменить кнопку на любую иконку (не только глаз).

[Ссылка на Компонент Input, на основе которого будет сделан Компонент Password](https://github.com/lskjs/ux/tree/master/packages/form/src/controls/Input)

*Подсказка*
Чекер стойкости пароля можно сделать на основе этого пакета (или поискать более популярные аналоги):
https://www.npmjs.com/package/zxcvbn
https://github.com/dropbox/zxcvbn

## 2. Компонент Password - добавить индикатор сложности пароля

Требования к компоненту:
- Добавить индикатор надежности пароля в виде полоски, которая меняет свой цвет и длину;
- Добавить справа от индикатора вспомогательный текст, который иммеет два состояния: "слабый" и "надежный";
- Привести к дизайну (скриншот прикреплен выше).
